Revit 2027 API
TableView.GetAvailableParameters Method
 Gets a list of valid parameters for the specified category that can be used in the table view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetAvailableParameters(
	Document cda,
	ElementId categoryId
)
Public Shared Function GetAvailableParameters (
	cda As Document,
	categoryId As ElementId
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetAvailableParameters(
	Document^ cda,
	ElementId^ categoryId
)
static member GetAvailableParameters :
        cda : Document *
        categoryId : ElementId -> IList<ElementId>
Parameters
cda Document
 The document.
categoryId ElementId
 The specified element category id.
Return Value
IList<ElementId>
 The IDs of all valid parameters.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace